# Summary of Notebook
    Full Set: 49688
    Exported as pickle & saved as products_ready_to_clean
    Memory: Reduced memory of original file
    Datatype:
        product_id = int32
        department_id = int16
    Null:
        product_name has 16 products without a name with a high price range (so more costly items)
    Duplicates: dropped 5 duplicates
    Statistics:
       product_id has a range of 1 to 49688
       aisle_id has a range of 1 to 134
       price has a range of 1 to 99999

In [1]:
#importing libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy
import datetime as dt

In [2]:
#import csv customers dataframe
df_products = pd.read_csv(r'C:\Users\Selena\Desktop\3-22 Instacart Basket Analysis\02 Data\Original Data\products.csv')
path = r'C:\Users\Selena\Desktop\3-22 Instacart Basket Analysis'
df_products = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'))

In [3]:
#getting to know the dataframe
df_products.shape

(49693, 5)

In [4]:
#seeing the type of data and columns
df_products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49693 entries, 0 to 49692
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49693 non-null  int64
 1   product_name   49677 non-null  object
 2   aisle_id       49693 non-null  int64
 3   department_id  49693 non-null  int64
 4   prices         49693 non-null  float64
dtypes: float64(1), int64(3), object(1)
memory usage: 1.9+ MB

In [5]:
#seeing the columns and data
df_products.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [6]:
#seeing the end of the columns and data
df_products.tail()

,product_id,product_name,aisle_id,department_id,prices
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3
49689,49685,En Croute Roast Hazelnut Cranberry,42,1,3.1
49690,49686,Artisan Baguette,112,3,7.8
49691,49687,Smartblend Healthy Metabolism Dry Cat Food,41,8,4.7
49692,49688,Fresh Foaming Cleanser,73,11,13.5

In [7]:
#renaming for consistency
df_products.rename(columns={'prices': 'price'}, inplace=True)

In [8]:
#checking for chnage
df_products.head()

,product_id,product_name,aisle_id,department_id,price
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [9]:
#seeing info again
df_products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49693 entries, 0 to 49692
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49693 non-null  int64
 1   product_name   49677 non-null  object
 2   aisle_id       49693 non-null  int64
 3   department_id  49693 non-null  int64
 4   price          49693 non-null  float64
dtypes: float64(1), int64(3), object(1)
memory usage: 1.9+ MB

In [10]:
#changing datatype to reduce memory - changing objects to category
df_products['product_name'] = df_products['product_name'].astype('category')

In [11]:
#seeing what kind of interger type is best
df_products.describe()

         product_id      aisle_id  department_id         price
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [12]:
#changing datatype to reduce memory - datatype int16
df_products[['aisle_id', 'department_id']] = df_products[['aisle_id', 'department_id']].astype("int16")

In [13]:
#changing datatype back to int32 because I messed up
df_products ['product_id'] = df_products ['product_id'].astype("int32")

In [14]:
#checking dataframe
df_products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49693 entries, 0 to 49692
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49693 non-null  int32
 1   product_name   49677 non-null  category
 2   aisle_id       49693 non-null  int16
 3   department_id  49693 non-null  int16
 4   price          49693 non-null  float64
dtypes: category(1), float64(1), int16(2), int32(1)
memory usage: 2.3 MB

# Notes on memory change:  no real change

In [15]:
#seeing if any data is missing
df_products.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
price             0
dtype: int64

# Notes on null findings: there are 16 products without a name

In [16]:
#printing more information on the products with missing names
nan_values = df_products[df_products['product_name'].isna()]

print (nan_values)

       product_id product_name  aisle_id  department_id  price
33             34          NaN       121             14   12.2
68             69          NaN        26              7   11.8
115           116          NaN        93              3   10.8
261           262          NaN       110             13   12.1
525           525          NaN       109             11    1.2
1511         1511          NaN        84             16   14.3
1780         1780          NaN       126             11   12.3
2240         2240          NaN        52              1   14.2
2586         2586          NaN       104             13   12.4
3159         3159          NaN       126             11   13.1
3230         3230          NaN       120             16   14.4
3736         3736          NaN        41              8   14.8
4283         4283          NaN        77              7   14.4
4790         4790          NaN        91             16   14.5
38187       38183          NaN        39             12   20.9
40444       40440          NaN       120             16   14.8

In [17]:
#looking for duplicates
(df_products.duplicated().value_counts())

False    49688
True         5
dtype: int64

In [18]:
#curious to see what was duplicated
df2 = df_products[df_products.duplicated()]
print(df2)

       product_id                                       product_name  \
462           462                  Fiber 4g Gummy Dietary Supplement
18459       18458                                         Ranger IPA
26810       26808               Black House Coffee Roasty Stout Beer
35309       35306  Gluten Free Organic Peanut Butter & Chocolate ...
35495       35491                            Adore Forever Body Wash

       aisle_id  department_id  price
462          70             11    4.8
18459        27              5    9.2
26810        27              5   13.4
35309       121             14    6.8
35495       127             11    9.9

In [19]:
df_products.drop_duplicates()

,product_id,product_name,aisle_id,department_id,price
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3
...,...,...,...,...,...
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3
49689,49685,En Croute Roast Hazelnut Cranberry,42,1,3.1
49690,49686,Artisan Baguette,112,3,7.8
49691,49687,Smartblend Healthy Metabolism Dry Cat Food,41,8,4.7
49692,49688,Fresh Foaming Cleanser,73,11,13.5

# Notes on duplicates: 5 duplicates found. Dropped them

In [20]:
#need to save the new dataframe without duplicates
df_products = df_products.drop_duplicates()

In [21]:
#checking the result
df_products.describe()

         product_id      aisle_id  department_id         price
count  49688.000000  49688.000000   49688.000000  49688.000000
mean   24844.500040     67.769582      11.728687      9.994254
std    14343.834402     38.316162       5.850410    453.542503
min        1.000000      1.000000       1.000000      1.000000
25%    12422.750000     35.000000       7.000000      4.100000
50%    24844.500000     69.000000      13.000000      7.100000
75%    37266.250000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [22]:
#exporting the file as a pickle
df_products.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'products_ready_to_clean.pkl'))